-- --------------------------------------------------------
-- 主机:                           67.216.199.218
-- 服务器版本:                        5.6.42 - MySQL Community Server (GPL)
-- 服务器操作系统:                      Linux
-- HeidiSQL 版本:                  9.4.0.5125
-- --------------------------------------------------------

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET NAMES utf8 */;
/*!50503 SET NAMES utf8mb4 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;


-- 导出 mpsg_server 的数据库结构
CREATE DATABASE IF NOT EXISTS `mpsg_server` /*!40100 DEFAULT CHARACTER SET latin1 */;
USE `mpsg_server`;

-- 导出  表 mpsg_server.loaction_info 结构
CREATE TABLE IF NOT EXISTS `loaction_info` (
  `loaction_id` int(11) NOT NULL AUTO_INCREMENT,
  `user_login_id` varchar(20) NOT NULL,
  `longitude` varchar(20) NOT NULL DEFAULT '0',
  `latitude` varchar(20) NOT NULL DEFAULT '0',
  `timeStr` varchar(20) DEFAULT NULL,
  PRIMARY KEY (`loaction_id`)
) ENGINE=InnoDB AUTO_INCREMENT=76 DEFAULT CHARSET=utf8;

-- 正在导出表  mpsg_server.loaction_info 的数据：~69 rows (大约)
/*!40000 ALTER TABLE `loaction_info` DISABLE KEYS */;
INSERT INTO `loaction_info` (`loaction_id`, `user_login_id`, `longitude`, `latitude`, `timeStr`) VALUES
	(1, '123456@qq.com', '30.310892', '120.343938', '2018-12-02 15:36:24'),
	(2, '123456@qq.com', '30.31089', '120.343939', '2018-12-02 15:38:25'),
	(3, '123456@qq.com', '30.310894', '120.343939', '2018-12-02 15:40:24'),
	(4, '123456@qq.com', '30.310922', '120.343958', '2018-12-02 15:42:23'),
	(5, '123456@qq.com', '30.310924', '120.343952', '2018-12-02 15:44:26'),
	(6, '123456@qq.com', '30.310897', '120.343938', '2018-12-02 15:46:25'),
	(7, '123456@qq.com', '30.310908', '120.343949', '2018-12-02 15:48:25'),
	(8, '123456@qq.com', '30.310935', '120.343964', '2018-12-02 15:50:24'),
	(9, '123456@qq.com', '30.310915', '120.343955', '2018-12-02 15:52:23'),
	(10, '123456@qq.com', '30.310947', '120.343959', '2018-12-02 15:54:26'),
	(11, '123456@qq.com', '30.31091', '120.343951', '2018-12-02 15:56:25'),
	(12, '123456@qq.com', '30.310932', '120.343951', '2018-12-02 15:58:26'),
	(13, '123456@qq.com', '30.310929', '120.343948', '2018-12-02 16:00:27'),
	(14, '123456@qq.com', '30.31089', '120.343934', '2018-12-02 16:02:23'),
	(15, '123456@qq.com', '30.310894', '120.343937', '2018-12-02 16:04:27'),
	(16, '123456@qq.com', '30.310876', '120.343921', '2018-12-02 16:06:25'),
	(17, '123456@qq.com', '30.3109', '120.343944', '2018-12-02 16:08:26'),
	(18, '123456@qq.com', '30.310911', '120.343949', '2018-12-02 16:10:27'),
	(19, '123456@qq.com', '30.310893', '120.343941', '2018-12-02 16:12:26'),
	(20, '123456@qq.com', '30.310918', '120.343947', '2018-12-02 16:14:26'),
	(21, '123456@qq.com', '30.310887', '120.343938', '2018-12-02 16:16:26'),
	(22, '123456@qq.com', '30.310888', '120.343938', '2018-12-02 16:18:27'),
	(23, '123456@qq.com', '30.3109', '120.343946', '2018-12-02 16:20:22'),
	(24, '123456@qq.com', '30.310909', '120.343952', '2018-12-02 16:22:26'),
	(25, '123456@qq.com', '30.310914', '120.343946', '2018-12-02 16:24:26'),
	(26, '123456@qq.com', '30.310896', '120.343943', '2018-12-02 16:26:23'),
	(27, '123456@qq.com', '30.310896', '120.343941', '2018-12-02 16:28:27'),
	(28, '123456@qq.com', '30.310916', '120.343957', '2018-12-02 16:30:23'),
	(29, '123456@qq.com', '30.310915', '120.343955', '2018-12-02 16:32:27'),
	(30, '123456@qq.com', '30.310909', '120.343948', '2018-12-02 16:34:23'),
	(31, '123456@qq.com', '30.310919', '120.343958', '2018-12-02 16:36:24'),
	(32, '123456@qq.com', '30.310919', '120.343959', '2018-12-02 16:38:23'),
	(33, '123456@qq.com', '30.310928', '120.34395', '2018-12-02 16:40:27'),
	(34, '123456@qq.com', '30.310916', '120.343942', '2018-12-02 16:42:23'),
	(35, '123456@qq.com', '30.310922', '120.343945', '2018-12-02 16:44:23'),
	(36, '123456@qq.com', '30.310934', '120.343961', '2018-12-02 16:45:33'),
	(37, '123456@qq.com', '30.310939', '120.343966', '2018-12-02 16:47:37'),
	(38, '123456@qq.com', '30.310932', '120.343963', '2018-12-02 16:48:43'),
	(39, '123456@qq.com', '30.310922', '120.343955', '2018-12-02 16:50:47'),
	(40, '123456@qq.com', '30.310934', '120.343957', '2018-12-02 16:52:43'),
	(41, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 16:54:43'),
	(42, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 16:57:28'),
	(43, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:00:00'),
	(44, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:00:43'),
	(45, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:03:07'),
	(46, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:04:47'),
	(47, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:06:43'),
	(48, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:09:24'),
	(49, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:10:43'),
	(50, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:12:43'),
	(51, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:14:43'),
	(52, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:16:43'),
	(53, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:18:43'),
	(54, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:20:43'),
	(55, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:22:43'),
	(56, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:24:43'),
	(57, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:27:28'),
	(58, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:29:32'),
	(59, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:30:43'),
	(60, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:33:52'),
	(61, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:34:43'),
	(62, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:36:43'),
	(63, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:38:43'),
	(64, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:40:53'),
	(65, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:42:43'),
	(66, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:44:49'),
	(67, '123456@qq.com', '30.310992', '120.343977', '2018-12-02 17:46:43'),
	(68, '123456@qq.com', '30.310973', '120.343992', '2018-12-12 14:10:51'),
	(69, '123456@qq.com', '30.310976', '120.343993', '2018-12-12 14:13:16'),
	(70, '123456@qq.com', '30.310983', '120.343997', '2018-12-12 14:15:15'),
	(71, '123456@qq.com', '30.310963', '120.34399', '2018-12-12 14:17:15'),
	(72, '123456@qq.com', '30.310947', '120.343981', '2018-12-12 14:18:41'),
	(73, '123456@qq.com', '30.310947', '120.343981', '2018-12-12 14:20:41'),
	(74, '123456@qq.com', '30.310952', '120.34397', '2019-01-07 19:02:37'),
	(75, '123456@qq.com', '30.310937', '120.343963', '2019-01-07 19:04:51');
/*!40000 ALTER TABLE `loaction_info` ENABLE KEYS */;

-- 导出  表 mpsg_server.order_info 结构
CREATE TABLE IF NOT EXISTS `order_info` (
  `order_id` int(11) NOT NULL AUTO_INCREMENT,
  `order_context` varchar(20) NOT NULL,
  `order_explain` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`order_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

-- 正在导出表  mpsg_server.order_info 的数据：~0 rows (大约)
/*!40000 ALTER TABLE `order_info` DISABLE KEYS */;
/*!40000 ALTER TABLE `order_info` ENABLE KEYS */;

-- 导出  表 mpsg_server.user_info 结构
CREATE TABLE IF NOT EXISTS `user_info` (
  `user_id` int(11) NOT NULL AUTO_INCREMENT,
  `user_name` varchar(20) DEFAULT NULL,
  `user_login_id` varchar(20) NOT NULL,
  `user_isGuardOn` int(2) NOT NULL DEFAULT '0',
  `user_phoneId` varchar(25) DEFAULT NULL,
  `user_pwd` varchar(128) NOT NULL,
  `user_Guard_pwd` varchar(128) NOT NULL,
  `user_register_time` datetime DEFAULT CURRENT_TIMESTAMP,
  `user_other` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=100009 DEFAULT CHARSET=utf8;

-- 正在导出表  mpsg_server.user_info 的数据：~9 rows (大约)
/*!40000 ALTER TABLE `user_info` DISABLE KEYS */;
INSERT INTO `user_info` (`user_id`, `user_name`, `user_login_id`, `user_isGuardOn`, `user_phoneId`, `user_pwd`, `user_Guard_pwd`, `user_register_time`, `user_other`) VALUES
	(100000, 'Jack', '123456@qq.com', 1, '864601021084058', '7c4a8d09ca3762af61e59520943dc26494f8941b', '123456', '2018-08-08 16:42:13', '测试账号'),
	(100001, NULL, '123456789@qq.com', 0, '000000000000000', 'f7c3bc1d808e04732adf679965ccc34ca7ae3441', '', '2018-08-10 15:50:09', NULL),
	(100002, NULL, '1234567@qq.com', 0, NULL, '20eabe5d64b0e216796e834f52d61fd0b70332fc', '', '2018-08-10 15:53:28', NULL),
	(100003, NULL, '123456887vv@qq.com', 0, NULL, '20eabe5d64b0e216796e834f52d61fd0b70332fc', '', '2018-08-10 15:58:43', NULL),
	(100004, NULL, '123456887vvj@qq.com', 0, NULL, '20eabe5d64b0e216796e834f52d61fd0b70332fc', '', '2018-08-10 15:59:44', NULL),
	(100005, NULL, '12346679@qq.com', 0, NULL, '7c4a8d09ca3762af61e59520943dc26494f8941b', '', '2018-08-10 16:00:26', NULL),
	(100006, NULL, '1234667m9@qq.com', 0, NULL, '7c4a8d09ca3762af61e59520943dc26494f8941b', '', '2018-08-10 16:01:53', NULL),
	(100007, NULL, '12345678xx9@qq.com', 0, NULL, '20eabe5d64b0e216796e834f52d61fd0b70332fc', '', '2018-08-10 16:08:35', NULL),
	(100008, NULL, '11223@qq.com', 0, NULL, '7c4a8d09ca3762af61e59520943dc26494f8941b', '', '2018-08-20 10:19:04', NULL);
/*!40000 ALTER TABLE `user_info` ENABLE KEYS */;

-- 导出  表 mpsg_server.user_pressure_store 结构
CREATE TABLE IF NOT EXISTS `user_pressure_store` (
  `user_pressure_id` int(11) NOT NULL AUTO_INCREMENT,
  `user_login_id` varchar(20) NOT NULL,
  `pressure` varchar(20) NOT NULL,
  `fingerID` int(11) NOT NULL,
  PRIMARY KEY (`user_pressure_id`)
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8;

-- 正在导出表  mpsg_server.user_pressure_store 的数据：~14 rows (大约)
/*!40000 ALTER TABLE `user_pressure_store` DISABLE KEYS */;
INSERT INTO `user_pressure_store` (`user_pressure_id`, `user_login_id`, `pressure`, `fingerID`) VALUES
	(1, '123456@qq.com', '0.1764706', 0),
	(2, '123456@qq.com', '0.19607845', 0),
	(3, '123456@qq.com', '0.18039216', 0),
	(4, '123456@qq.com', '0.1764706', 0),
	(5, '123456@qq.com', '0.17254902', 0),
	(6, '123456@qq.com', '0.18431373', 0),
	(7, '123456@qq.com', '0.19215688', 0),
	(8, '123456@qq.com', '0.20000002', 0),
	(9, '123456@qq.com', '0.14509805', 0),
	(10, '123456@qq.com', '0.19607845', 0),
	(11, '123456@qq.com', '0.20000002', 0),
	(12, '123456@qq.com', '0.20000002', 0),
	(13, '123456@qq.com', '0.21176472', 0),
	(14, '123456@qq.com', '0.16078432', 0);
/*!40000 ALTER TABLE `user_pressure_store` ENABLE KEYS */;

/*!40101 SET SQL_MODE=IFNULL(@OLD_SQL_MODE, '') */;
/*!40014 SET FOREIGN_KEY_CHECKS=IF(@OLD_FOREIGN_KEY_CHECKS IS NULL, 1, @OLD_FOREIGN_KEY_CHECKS) */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
